<template>
    <Form class="inner-form" ref="smsVerifyData" :model="smsVerifyData" :rules="ruleValidate" :label-width="120">
        <Form-item label="手机号" prop="mob_bind">
            <Row>
                <Col span="16">
                    <Input v-model="smsVerifyData.mob_bind"></Input>
                </Col>
                <Col span="1">&nbsp;</Col>
                <Col span="7">
                    <Button :loading="verifyloading" @click="verify('smsVerifyData')">
                        <span v-if="!verifyloading">获取验证码</span>
                        <span v-else>获取中...</span>
                    </Button>
                </Col>
            </Row>
        </Form-item>
        <Form-item label="验证码" prop="verify_code">
            <Input v-model="smsVerifyData.verify_code"></Input>
        </Form-item>
        <Form-item prop="agreement">
            <CheckboxGroup v-model="smsVerifyData.agreement">
                <Checkbox><a @click="modal8 = true">连连支付开户协议</a></Checkbox>
            </CheckboxGroup>
            <Modal v-model="modal8" :mask-closable="false" :closable="false" width="800" cancelText="">
                <p>
                <p align="center"><strong>开</strong><strong>户协议</strong></p>

                <p>&nbsp;</p>

                <p>您在连连银通电子支付有限公司（&ldquo;连连支付&rdquo;）开立电子支付账户（&ldquo;支付账户&rdquo;）前应详细阅读本协议，一经使用本协议所载之服务，即视为同意本协议的各项约定。</p>

                <p>&nbsp;</p>

                <p>支付账户的开立和使用应遵守《非银行支付机构网络支付服务管理办法》《支付机构反洗钱和反恐怖融资管理办法》等相关规定和本协议的各项约定，如涉及个人汇兑，尚需遵守《个人外汇管理办法》及其实施细则等相关规定，如年度外汇总额限制等规定。<strong>同时，您知道支付账户所记录的资金余额不同于您本人的银行存款，不受《存款保险条例》保护，其实质是您委托支付机构保管的、所有权归属于您的预付价值。该预付价值对应的货币资金虽然属于您，但不以您本人名义存放在银行，而是以连连支付名义存放在银行，并且由连连支付向银行发起资金调拨指令。</strong></p>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第一条 开户条件</strong></li>
                </ul>

                <ol>
                    <li value="">一. 本账户为电子支付账户，您同意开立支付账户，并知悉支付账户需遵循支付相关的法律法规；</li>
                    <li value="">二. 在您同意接受本协议时，您具有中华人民共和国法律规定的完全民事权利能力和民事行为能力，是能够独立承担民事责任的自然人、法人或其他组织；如您所属的国家或地区排除本协议内容的全部或部分，您应立即停止使用本服务。未成年人不得开立支付账户，您应已年满16周岁；</li>
                    <li value="">三. 您需使用您本人的姓名、住址、联系方式和身份证号等真实的身份信息开立支付账户。您只有在通过实名认证后，方可开立支付账户。</li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第二条 网址确认</strong></li>
                </ul>

                <p>您在使用本服务时，应先确认连连支付的正确页面，方可使用连连支付的服务，如有疑问，可以致电连连支付客服中心86-400-0188-888询问。</p>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第三条 开立和使用</strong><strong>账户</strong></li>
                </ul>

                <ol>
                    <li value="">一. 连连支付按照实名制管理要求，登记并采取有效措施验证您身份信息，按照规定核对有效身份证件并留存有效身份证件复印件或者影印件，建立您的唯一识别编码，确保有效核实您的身份及其真实意愿后，为其开立支付账户。如您为个人用户，您了解并知悉，连连支付依据身份核验方式的不同为您开立相应余额付款功能的支付账户，且在连连支付您只能开立一个III类支付账户：</li>
                </ol>

                <p>&nbsp;</p>

                <table align="center" border="1" cellpadding="0" cellspacing="0">
                    <tbody>
                    <tr>
                        <td style="width:104px;height:45px;">
                            <p align="center"><strong>支付账户类别</strong></p>
                        </td>
                        <td style="width:198px;height:45px;">
                            <p align="center"><strong>身份核验方式</strong></p>
                        </td>
                        <td style="width:76px;height:45px;">
                            <p align="center"><strong>支付账户余额付款功能</strong></p>
                        </td>
                        <td style="width:175px;height:45px;">
                            <p align="center"><strong>支付账户余额付款限额</strong></p>
                        </td>
                    </tr>
                    <tr>
                        <td style="width:104px;">
                            <p align="center">I类账户</p>
                        </td>
                        <td style="width:198px;">
                            <p>对于以非面对面方式通过至少一个合法安全的外部渠道验证身份</p>
                        </td>
                        <td style="width:76px;">
                            <p>消费、转账</p>
                        </td>
                        <td style="width:175px;">
                            <p>自账户开立起累计不超过1000 元（包括支付账户向客户本人同名银行账户</p>

                            <p>转账）</p>
                        </td>
                    </tr>
                    <tr>
                        <td style="width:104px;">
                            <p align="center">II类账户</p>
                        </td>
                        <td style="width:198px;">
                            <p>自主或委托合作机构以面对面方式核实身份的个人客户，或以非面对面方式通过至少三个合法安全的外部渠道验证身份</p>
                        </td>
                        <td style="width:76px;">
                            <p>消费、转账</p>
                        </td>
                        <td style="width:175px;">
                            <p>年累计不超过10 万元（不包括支付账户向客户本人同名银行账户转账），单笔、单日、单月限额见账户备注</p>
                        </td>
                    </tr>
                    <tr>
                        <td style="width:104px;">
                            <p align="center">III类账户</p>
                        </td>
                        <td style="width:198px;">
                            <p>自主或委托合作机构以面对面方式核实身份的个人客户，或以非面对面方式通过至少五个合法安全的外部渠道验证身份</p>
                        </td>
                        <td style="width:76px;">
                            <p>消费和转账、投资理财</p>
                        </td>
                        <td style="width:175px;">
                            <p>年累计不超过20 万元（不包括支付账户向客户本人同名银行账户转账）</p>
                        </td>
                    </tr>
                    </tbody>
                </table>

                <div style="clear:both;">&nbsp;</div>

                <p>备注：</p>

                <p>II类和III类账户单笔、单日、单月、单日最大笔数提现和转账的限制根据产品不同而不同。转账方式包括实时到账、普通到账和次日到账，可能会因产品不同而有差异，详见产品说明。单位用户不区分I类、II类、III类支付账户，支付账户功能或金额视具体业务场景有所不同。</p>

                <p>&nbsp;</p>

                <ol>
                    <li value="">二. 您按照连连支付的流程和要求开立支付账户，您可自行为该支付账户设置密码，并用以查询或计量您交易款项。您需使用本人电子邮箱或手机号码，或者连连支付允许的其它方式，作为登录手段登录该账户。</li>
                    <li value="">三. 您的身份信息资料应当及时更新，如因您未及时更新基本资料，导致本服务无法提供或提供时发生任何错误，您将承担因此产生的一切后果。</li>
                    <li value="">四. 您通过支付账户向连连支付发出的指令，都不可撤回或撤销，且成为连连支付代理您支付或收取款项的唯一指令。</li>
                    <li value="">五. 在使用本服务时，您应遵从本服务条款或网站说明、交易页面中之操作提示、规则，未按照规则的指令连连支付可以拒绝执行，且不承担损害赔偿责任。</li>
                    <li value="">六. 用户可通过连连支付网站对其电子支付账户进行资金管理、交易统计查询。连连支付在&ldquo;连连支付平台&rdquo;为用户提供交易发生之日起十二个月内的国内支付业务交易数据，用户可以通过连连支付的服务网站查询当日对账单和十二个月内的历史对账单。超过十二个月以上的交易数据查询，可与连连支付客服人员联系。双方对账有分歧的，以结算银行的交易流水为准。</li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第四条 账户安全</strong></li>
                </ul>

                <ol>
                    <li value="">一. 连连支付通过您的支付账户用户名，密码及短信验证码或手势密码（以上合称&ldquo;支付账户信息&rdquo;）识别您的指示，您应当妥善保管您的支付账户密码及短信验证码或手势密码，<strong>对于因用户名、密码、短信验证码或手势密码泄露所致的损失，由您自行承担</strong>。您保证不向其他任何人泄露该支付账户及短信验证码或手势密码，亦不使用其他任何人的支付账户及短信验证密码或手势密码。</li>
                    <li value="">二. 因您的过错导致的任何损失由您自行承担，该过错包括但不限于：不按照交易提示操作，未及时进行交易操作，遗忘或泄漏支付账户号或密码，密码被他人破解，您使用的计算机被他人侵入。</li>
                    <li value="">三. 您的支付账户遭到冒用、盗用或有其他任何影响安全的问题发生时，请立即通知连连支付，并要求停止其使用本服务并采取防范之措施。在接到通知后，连连支付将终止为您的支付账户提供支付服务，做进一步调查，并视情况上报相关监管机构。连连支付于接受通知前（该等通知应不存在任何迟延情形），对第三人使用本服务已发生之效力和后果，包括但不限于，由于第三人盗用您支付账户信息而导致的及银行账户的损失，除您对未经合法授权之使用的形成存在故意或过失行为，连连支付将承担先行赔偿责任。若您迟延通知，则迟延期间产生的损失，连连支付将不需承担任何责任。如果您认为您的支付账户或手机验证码、手势密码可能存在安全问题，或者您发现有人私自使用您的支付账户或手机验证码、手势密码，请您立刻通知连连支付。若您发现任何未经许可的交易，或者有人已经知悉您的支付账户号或手机验证码、手势密码，或者您发现您的交易和支付记录有误，您必须立即通知连连支付，这是您的义务和责任。您的及时通知将可能有助于保护您的权益。在发生任何违法交易、盗窃或诈骗行为等触犯刑法之情况时，您应向连连支付提交相应的资料或证据证明未经许可发生的交易损失，同时连连支付将按照有关司法机关之指示行事。由此涉及您的合法权益时，您应及时主动向连连支付、银行或有关司法机构提供有关交易证据，必要时您应就您提供的证据向银行或有关司法机构进行说明，如未能提供真实有效的交易证据，您应独立承担由此造成的一切损失。</li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第五条 交易记录和信息保密</strong></li>
                </ul>

                <ol>
                    <li value="">一. 连连支付将对您在使用本服务中的所有操作进行记录，不管该操作的目的最终是否实现，供您在本系统中实时查询。连连支付将以电子邮件（或发送到该手机的信息或电话等）方式通知您交易进展情况、交易处理结果等，和/或提示您进行下一步的操作，<strong>但连连支付不保证您能够收到或者及时收到该邮件（或发送到该手机的信息或电话等），且不对此承担任何后果</strong>，因此，在交易过程中您应当及时登录到本网站查看和进行交易操作。<strong>如连连支付的交易进展信息与您从或银行收到的交易进展信息不一致，交易进展信息以银行为准，且您应当立即将上述情况通知连连支付。因您没有及时查看和对交易状态进行修改或确认或未能提交相关申请而导致的任何纠纷或损失，连连支付除通知义务外不负任何责任。</strong>如您以本系统的纪录为基础，与您的进行核对查询后，认为数额有误，可以通过连连支付查询，则连连支付将向您提供连连支付已按照您的指示付款的纪录，您了解并同意您最终能够付款或提款的责任是由对应的银行提供的，您需向该银行请求查证。</li>
                    <li value="">二. 您知道并同意连连支付可能会收集并储存<strong>您的个人信息如您的姓名、身份证明、地址、电话号码和电子邮件地址、生物特征等信息及相关附加信息（如您所在的省份和城市、邮政编码等）、银行账户信息或其他支付工具的账户信息、您操作的相关信息、可能为了提供服务及改进服务质量的合理需要而收集您的其他信息。</strong>连连支付重视对用户隐私的保护，我们努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。我们对可能接触到您的信息的员工或外包服务商也采取了严格管理。</li>
                    <li value="">三. 在本服务内容的范围内您同意连连支付可以将您的个人身份信息、交易信息、结汇记录等提供给合作银行、连连支付的供应商、连连支付的关联公司或其他为了完成本服务必须获得以上信息的有权机构。</li>
                    <li value="">四. 有关您的真实的所有款项来源记录的交易信息和通过连连支付交易的记录应自交易记账当年计起至少保存5年。如因监管机构或司法机构的要求，或按照法律法规的规定，或连连支付需要核实您的资金来源和您的交易背景时，您有义务及时提供连连支付所要求的所涉收取款项所相关的真实的交易记录。您不得删除交易记录规避交易记录提供的义务。如您需要注销（永久冻结）您的相关账户，或您的相关账户被您的相关账户平台服务商关闭，您应当要求并在此授权相关账户平台服务商向连连支付提供您的所有款项来源的真实交易记录。如您未尽提供的义务或未履行协助提供的承诺，连连支付可以暂停或终止向您提供的服务。如连连支付因此承担法律义务或行政罚款，您应赔偿连连支付由此产生或承担的所有的损失和支出，包括但不限于连连支付为履行该法律义务必须支出的费用、以及诉讼或仲裁的费用、律师费、保全费及罚款等。</li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第六条 关闭或注销账户</strong></li>
                    <li>和第三方平台服务商。如不存在您与第三方平台服务商之间的争议且符合双方的服务协议的流程，您可注销该支付账户的服务后，即表明连连支付与您之间的协议已解除，但您仍应对您使用本服务期间的行为承担可能的违约或损害赔偿责任，同时连连支付仍可保有您的相关信息。</li>
                </ul>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第七条 外汇服务（如适用）</strong></li>
                </ul>

                <ol>
                    <li value="">一. 签署本协议，意味着您与连连支付合作银行之间也形成服务关系，相应的权利义务即由您与连连支付合作银行负责履行与承担，连连支付不对此提供任何形式的担保或承担与之相关的其他法律责任。</li>
                    <li value="">二. 连连支付收到汇款的资金后在银行的工作时间内结汇，，汇兑汇率以汇款的合作公司公布的汇率为准。如果连连支付收到您的资金为银行或外汇管理局非工作时间，顺延到下一个日的工作时间结汇。您的资金按照实际到账时间结汇，使用实时汇率。</li>
                    <li value="">三. 如因法律法规、政府政策限制或因您的外汇结汇额度不足导致不能结汇，由您自行负责。连连支付对您的结汇额度无主动查询义务，如连连支付获知您已超出结汇额度，连连支付有权不执行该交易，如已兑换，连连支付可就您结汇超额部分以连连支付认为适当的方式冲回。（贸易项下交易不适用）</li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第八条 担保交易（如适用）</strong></li>
                    <li>&nbsp;</li>
                </ul>

                <p>&nbsp;</p>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第九条 服务规则和收费</strong></li>
                </ul>

                <ol>
                    <li value="">一. 您在使用本服务过程中，本协议内容、网页上出现的关于交易操作的提示或连连支付发送到该手机的信息（短信或电话等）内容是您使用本服务的相关规则，您使用本服务即表示您同意接受本服务的相关规则。<strong>您了解并同意连连支付单方修改服务的相关规则，而无须征得您的同意。</strong>连连支付会提前30日将上述规则调整在连连支付网站上公布，不另作个別通知。服务规则应以您使用服务时的页面提示（或发送到该手机的信息或电话等）为准，您同意并遵照服务规则是您使用本服务的前提。</li>
                    <li value="">二. 当您使用连连支付提供的支付服务时， 连连支付有权根据服务收费规则向您收取服务费用。连连支付有权制订及不时调整服务费，具体服务费用以连连支付在营业场所和网站上公示的服务收费规则为准。连连支付对服务费进行调整时，会在实施新的服务费标准之前在营业场所和网站上连续公示30日。</li>
                    <li value="">三. 由于连连支付并非银行或其它金融机构，本协议项下的资金移转均通过合作银行来实现，您理解并同意您的资金于流转途中所花费的合理时间，同时您知道并了解您的资金的实际到账时间将会受到境内外银行的节假日影响而延迟或暂定暂停，并顺延至恢复的第一个工作日后即时办理，您同意并承担由于资金到账和汇兑时间的延迟带来的汇率损益。</li>
                    <li value="">四. 连连支付为用户提供服务，工作时间为以连连支付官网公布的工作时间为准。连连支付设立服务电话，负责解答用户在使用连连支付中遇到的各种疑问，并协商处理用户在数据对账、资金结算过程中提出的问题，及时应答用户的争议和投诉。</li>
                </ol>

                <p>&nbsp;</p>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第十条 禁止行为</strong></li>
                </ul>

                <p align="left">您在使用本服务时应遵守中华人民共和国相关法律法规、相关国际惯例，连连支付用户协议用户使用规则，不将本服务用于任何非法目的（包括用于禁止或限制交易物品的交易），也不以任何非法方式使用本服务。当您使用本服务时，严禁从事以下行为：</p>

                <ol>
                    <li value="">一. 侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。</li>
                    <li value="">二. 违反依法定或约定之保密义务。</li>
                    <li value="">三. 冒用他人名义使用本服务。</li>
                    <li value="">四. 从事不法交易行为，如洗钱、贩卖枪支、毒品、禁药、盗版软件、黄色淫秽物品、其他连连支付认为不得使用本服务进行交易的物品等。</li>
                    <li value="">五. 提供赌博资讯或以任何方式引诱他人参与赌博。</li>
                    <li value="">六. 非法使用他人账户或无效账户支付。</li>
                    <li value="">七. 进行与您或交易对方宣称的交易内容不符的交易，或不真实的交易。</li>
                    <li value="">八. 从事任何可能含有电脑病毒或是可能侵害本服务系统、资料之行为。</li>
                    <li value="">九. 其他法律法规禁止从事的行为。</li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第十一条 服务中止或终止以及资金冻结</strong></li>
                </ul>

                <ol>
                    <li value="">一. <strong>您同意连连支付有权基于单方判断，包含但不限于连连支付认为您已经违反本服务条款的明文规定及精神，或在发现异常交易或有疑异或有违法之虞时，或在其他必要时不经事先通知而撤回/撤销您通过</strong><strong>支付账户向连连支付发出的指令，</strong><strong>或中止或终止本服务之部分或全部功能，同时连连支付可以基于上述判断冻结您的资金。</strong>连连支付有权向相关监管机关报告，或要求您向连连支付提供合法有效的交易证据，必要时您应就您提供的证据向连连支付、银行或有关司法机构予以说明。否则，您应独立承担由此造成的一切损失。</li>
                    <li value="">二. 若连连支付有合理理由怀疑您提供的身份信息及相关资料错误、不实、过时或不完整的，连连支付有权暂停或终止向您提供部分或全部支付服务。连连支付对此不承担任何责任，您将承担因此产生的任何直接或间接支出。若因国家法律法规、部门规章或监管机构的要求，连连支付需要您在注册完成后继续补充提供任何相关资料时，如您不能及时配合提供，连连支付有权暂停或终止向您提供部分或全部的支付服务。</li>
                    <li value="">三. <strong>为了使连连支付或第三方避免承担责任的风险，或者如果我们认为您可能在从事潜在的欺诈性或可疑活动和（或）交易，我们可以在一段合理的期限内冻结您的资金。</strong></li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第十二条 系统中断或故障</strong></li>
                </ul>

                <p>因下列原因，致使您无法使用本服务或造成您损失的，连连支付将不承担任何责任：连连支付制定且预先通知的系统停机维护期间；因电信机线设备原因以致发生错误、迟滞中断或不能传递；因台风、地震、海啸、洪水、停电、战争、电脑黑客等不可抗力之因素，造成连连支付系统障碍不能正常执行业务。</p>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第十三条 责任范围及责任限制</strong></li>
                </ul>

                <ol>
                    <li value="">一. 连连支付仅对本协议中列明的责任承担范围负责。</li>
                    <li value="">二. <strong>连连支付将遵照您的指示并根据连连支付的流程规定和要求从您指定的进行扣款。为避免疑义，连连支付不提供预支或垫付、透支、现金存取和融资服务。</strong></li>
                    <li value="">三. <strong>您明确因交易所产生的任何风险应由您自行承担。</strong></li>
                    <li value="">四. 用户信息是由您本人自行提供的，您应保证该信息之准确、及时和完整，您应对您的判断承担全部责任。</li>
                    <li value="">五. 连连支付不对交易及本服务提供任何形式的保证，包括但不限于以下事项：本服务符合您的需求及本服务不受干扰、及时提供或免于出错。</li>
                    <li value="">六. 您经由本服务之使用下载或取得任何资料，应由您自行考量且自负风险，因资料之下载而导致您电脑系统之任何损坏或资料流失，您应负完全责任。</li>
                    <li value="">七. 您自连连支付及连连支付工作人员或经由本服务取得之建议和资讯，无论其为书面或口头形式，均不构成连连支付对本服务之保证。</li>
                    <li value="">八. 在法律允许的情况下，连连支付对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除连连支付对上述损失的责任。</li>
                    <li value="">九. 除本协议另有规定外，在任何情况下，连连支付对本协议所承担的违约赔偿责任总额不超过向您收取的当次服务费用总额。</li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第十四条 知识产权保护</strong></li>
                </ul>

                <ol>
                    <li value="">一. 本网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由连连支付或其关联企业依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</li>
                    <li value="">二. 非经连连支付或其关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。</li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第十五条 协议变更及完整协议</strong></li>
                </ul>

                <ol>
                    <li value="">一. 本协议由本协议条款与及连连支付制定和公示的其他各项规则组成，相关名词可互相引用参照，如有不同理解，以本协议条款为准。您同意，在您使用连连支付的支付服务时，您应完全遵守本协议及连连支付制定的各项规则及页面提示等。</li>
                    <li value="">二. 连连支付有权在必要时单方修改或变更本服务协议之内容，并将通过连连支付网站（www.lianlianpay.com）提前30日公布最新的服务协议，不另作个別通知。若您于任何修改或变更本服务条款后继续使用本服务，则视为您已阅读、了解并同意接受修改或变更，若您不同意，则您应主动立即停用本服务。</li>
                </ol>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第十六条 文书送达</strong></li>
                </ul>

                <p>您同意以您在连连支付注册留存的地址或邮箱为相关文书之送达地址，如您需变更联系方式，应以书面方式通知连连支付，以变更后的地址或邮箱为送达地址；如您未通过书面方式进行变更，连连支付仍以您注册留存的地址或邮箱为送达地址。</p>

                <p>&nbsp;</p>

                <ul>
                    <li><strong>第十七条 法律适用及管辖</strong></li>
                </ul>

                <ol>
                    <li value="">一. 本用户协议的解释与适用，以及与本用户协议有关的争议，均应依照中华人民共和国法律，没有相关法律规定的，参照通用国际商业惯例和行业惯例。</li>
                    <li value="">二. 本用户协议如涉诉讼，应由中国杭州市滨江区人民法院为第一审管辖法院。</li>
                </ol>

                </p>
            </Modal>
        </Form-item>
        <Form-item>
            <Button type="primary" @click="handle('smsVerifyData')">
                下一步
            </Button>
        </Form-item>
    </Form>
</template>
<script>
export default {
    props: {
        onHandle: {
            type: Function,
            default () {
                return {};
            }
        },
    },
    data () {
        return {
            modal8: false,
            verifyloading: false,
            ruleValidate: {
                mob_bind: [
                    {required: true, message: '请输入手机号', trigger: 'blur'}
                ],
                verify_code: [
                    {required: true, message: '请输入验证码', trigger: 'blur'}
                ],
                agreement: [
                    //{required: true, type: "boolean", message: '请同意开户协议', trigger: 'change'}
                    { required: true, type: 'array', min: 1, max:1, message: '请同意开户协议', trigger: 'change' }
                ],
            },
            smsVerifyData: {
                mob_bind:'',
                verify_code:'',
                agreement: [],
            }
        }
    },
    methods: {
        handle(name) {
            this.$refs[name].validate((valid) => {
                if(valid) {
                    this.$store.dispatch('postSmscheckRequest', this.smsVerifyData)
                        .then((response) => {
                            if(response.status == 0)
                            {
                                this.$Message.warning(response.result.ret_msg)
                            }else{
                                this.onHandle(name);
                            }
                        })
                        .catch((error) => {
                            //console.log(error);
                        });
                }
            });

        },
        verify(name) {
            this.$refs[name].validateField('mob_bind',(valid) => {
                console.log(4);
                if(!valid) {
                    this.verifyloading = true;
                    this.$store.dispatch('postSmssendRequest', this.smsVerifyData)
                        .then((response) => {
                            this.verifyloading = false;
                            if(response.status == 0)
                            {
                                this.$Message.warning(response.result.ret_msg)
                            }else{
                                this.$Message.success('短信已发送');
                            }
                        })
                        .catch((error) => {
                            //console.log(error);
                            this.verifyloading = false;
                        });
                } else {
                    this.verifyloading = false;
                }
            });
        }
    }
}
</script>